# frozen_string_literal: true

tap 'charmbracelet/tap'
tap 'derailed/k9s'
tap 'dopplerhq/cli'
tap 'github/gh'
tap 'heroku/brew'
tap 'spacelift-io/spacelift'
tap 'superfly/tap'                   # for mods
tap 'gabrie30/utils'
tap 'danielfoehrkn/switch'

cask '1password-cli'
cask 'font-codicon'                  # VSCode font icons
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-source-sans-3'            # SuperOrbital
cask 'ghostty'
cask "google-cloud-sdk", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud --quiet components update"
cask 'orbstack', greedy: true

brew 'aspell'                        # Spell checker with better logic than ispell
brew 'ast-grep'                      # language aware grep (sg) https://ast-grep.github.io/
brew 'autoconf'                      # Automatic configure script builder
brew 'automake'                      # Tool for generating GNU Standards-compliant Makefiles
brew 'aws-sso-cli'                   # https://synfinatic.github.io/aws-sso-cli/
brew 'awscli'                        # Official Amazon AWS command-line interface
brew 'bash'                          # Bourne-Again SHell, a UNIX command interpreter
brew 'bash-completion@2'             # Common bash-completion libraries
brew 'bat'                           # Clone of cat(1) with syntax highlighting and Git integration
brew 'bat-extras'
brew 'bfg'
brew 'bzip2'                         # Freely available high-quality data compressor
brew 'cmake'                         # Cross-platform make
brew 'coreutils'                     # GNU File, Shell, and Text utilities
brew 'ctags'                         # Reimplementation of ctags(1)
brew 'diff-so-fancy'                 # Good-looking diffs with diff-highlight and more
brew 'diffutils'
brew 'direnv'                        # Load/unload environment variables based on $PWD
brew 'doppler'                       # doppler.com
brew 'efm-langserver'                # Trying this out with vim
brew 'entr'                          # Run arbitrary commands when files change
brew 'exiftool'                      # Perl lib for reading and writing EXIF metadata
brew 'fd'                            # Used by nvim treesitter
brew 'felinks'                       # For lesspipe
brew 'ffmpeg'                        # Play, record, convert, and stream audio and video
brew 'fzf'                           # used by vim finder
brew 'gawk'
brew 'gettext', link: true           # GNU internationalization (i18n) and localization (l10n) library
brew 'gh'                            # GitHub command-line tool
brew 'ghorg'                         # quickly clone all of an orgs, or users repos into a single directory
brew 'git'                           # Distributed revision control system
brew 'git-crypt'                     # Enable transparent encryption/decryption of files in a git repo
brew 'git-delta'
brew 'git-lfs'                       # Git extension for versioning large files
brew 'gnu-sed'
brew 'gnu-tar'                       # GNU version of the tar archiving utility
brew 'gnupg'                         # GNU Pretty Good Privacy (PGP) package
brew 'go'                            # Open source programming language to build simple/reliable/efficient software
brew 'gomplate'                      # For https://github.com/superorbital/infrastructure/blob/main/students/generate
brew 'gron'                          # Make JSON greppable
brew 'hadolint'                      # Amazing dockerfile linter
brew 'helm'
brew 'heroku'                        # Add GitHub support to git on the command-line
brew 'htop'
brew 'hub'                           # Used for campus
brew 'id3v2'                         # For lesspipe
brew 'imagemagick'                   # Tools and libraries to manipulate images in many formats
brew 'jq'                            # Lightweight and flexible command-line JSON processor
brew 'jsonnet'
brew 'jsonnet-bundler'
brew 'k9s'
brew 'kind'
brew 'kubectl'
brew 'kubectx'                       # kubens and kubectx
brew 'kubelogin'
brew 'kubernetes-cli'                # kubectl
brew 'lazygit'
brew 'lesspipe'                      # Input filter for the pager less
brew 'libnotify'                     # Library that sends desktop notifications to a notification daemon
brew 'libpq', force: true            # Used to get libpq and force linked to get psql cli in PATH
brew 'libxslt'                       # C XSLT library for GNOME
brew 'llvm'
brew 'man-db'                        # Avoid "This manpage is not compatible with mandoc(1)" errors
brew 'mediainfo'                     # For lesspipe
brew 'mise'                          # asdf alternative https://mise.jdx.dev/
brew 'mods'                          # AI on the CLI
brew 'moreutils'
brew 'neovim', args: ['HEAD']
brew 'neovim-remote'
brew 'node'                          # Platform built on V8 to build network applications
brew 'openssl'                       # SSL/TLS cryptography library
brew 'openssl@1.1'                   # Cryptography and SSL/TLS Toolkit
brew 'pandoc'                        # Swiss-army knife of markup format conversion
brew 'pass'                          # Password manager
brew 'pdftk-java'
brew 'pinentry-mac'
brew 'pre-commit'                    # git pre-commit hook runner
brew 'pstree'                        # Show ps output as a tree
brew 'python'                        # Interpreted, interactive, object-oriented programming language
brew 'rbenv'                         # Ruby version manager
brew 'rclone'
brew 'readline'                      # Library for command-line editing
brew 'ripgrep'                       # Needed by vim treesitter
brew 'rsync'
brew 'ruby-build'                    # Install various Ruby versions and implementations
brew 'ruff'                          # Python linting
brew 's3cmd'                         # Command-line tool for the Amazon S3 service
brew 'sassc'                         # Wrapper around libsass that helps to create command-line apps
brew 'shellcheck'                    # Static analysis and lint tool, for bash scripts
brew 'shfmt'                         # Shell fmt
brew 'sipcalc'                       # Advanced console-based IP subnet calculator
brew 'socat'                         # netcat on steroids
brew 'speedtest-cli'                 # Command-line interface for https://speedtest.net bandwidth tests
brew 'sqlite'                        # Command-line interface for SQLite
brew 'stern'
brew 'stow'                          # Used by ~/dotfiles
brew 'switch'
brew 'switchaudio-osx'               # Used in ~/bin/audio to switch between mics
brew 'tanka'
brew 'terraform'
brew 'tflint'                        # Terraform linter
brew 'the_silver_searcher'           # Code-search similar to ack
brew 'tig'                           # ncurses-based text-mode interface for git https://jonas.github.io/tig/
brew 'tmux'                          # Terminal multiplexer
brew 'tree'                          # Display directories as trees (with optional color/HTML output)
brew 'uv'                            # Python package and project manager
brew 'vim'                           # Vi 'workalike' with many additional features
brew 'watch'                         # Executes a program periodically, showing output fullscreen
brew 'wget'                          # Internet file retriever
brew 'xpdf'                          # For lesspipe
brew 'xz'                            # General-purpose data compression with high compression ratio
brew 'yarn'
brew 'yq'
brew 'zlib'                          # General-purpose lossless data-compression library
brew 'zsh'
brew 'zsh-fast-syntax-highlighting'  # Colorized command line prompt

# vim: ft=ruby
