{
  "Comment.nvim": { "branch": "master" },
  "bats.vim": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "bullets.vim": { "branch": "master" },
  "dressing.nvim": { "branch": "master" },
  "fidget.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "gruvbox-material": { "branch": "master" },
  "helpview.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "mini.animate": { "branch": "main" },
  "mini.splitjoin": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "none-ls.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-endwise": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-various-textobjs": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "refactoring.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
  "requirements.txt.vim": { "branch": "master" },
  "rustaceanvim": { "branch": "master" },
  "scss-syntax.vim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "0.1.x" },
  "todo-comments.nvim": { "branch": "main" },
  "tree-sitter-html": { "branch": "master" },
  "tree-sitter-markdown": { "branch": "split_parser" },
  "trouble.nvim": { "branch": "main" },
  "vim-css3-syntax": { "branch": "main" },
  "vim-dirvish": { "branch": "master" },
  "vim-dirvish-git": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-git": { "branch": "master" },
  "vim-go": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-javascript": { "branch": "master" },
  "vim-json": { "branch": "master" },
  "vim-jsonc": { "branch": "master" },
  "vim-rails": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-ruby": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
  "vim-smartword": { "branch": "master" },
  "vim-stay": { "branch": "master" },
  "vim-systemd-syntax": { "branch": "trunk" },
  "vim-templates": { "branch": "master" },
  "vim-terraform": { "branch": "master" },
  "vim-toml": { "branch": "main" },
  "which-key.nvim": { "branch": "main" }
}
